# SwitchFromLegendBeforeCreateSimilar Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..SwitchFromLegendBeforeCreateSimilar Property
BuiltInFailures..::..CreationFailures Class See Also
---
To Create Similar from a Legend View, first select the element, then activate the target view, then invoke Create Similar.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SwitchFromLegendBeforeCreateSimilar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SwitchFromLegendBeforeCreateSimilar As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SwitchFromLegendBeforeCreateSimilar {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace